In [2]:
# Add the Pandas dependency.
import pandas as pd
import numpy as np

In [3]:
traffick_data='Dashboard\human_traffick_sample_dataset_mrm.csv'

In [24]:
traffick_data_df = pd.read_csv(traffick_data)
traffick_data_df.shape

(208, 18)

In [5]:
country_count = traffick_data_df['country_of_exploitation'].value_counts()

country_count

KH    40
MY    34
US    30
CN    26
UA    26
IN    22
SA    14
BD    12
MD     2
VN     2
Name: country_of_exploitation, dtype: int64

In [6]:
# Add the count
df = pd.DataFrame(country_count)
df.rename(columns = {'country_of_exploitation': 'country'}, inplace = True)
df.columns

Index(['country'], dtype='object')

In [14]:
df.reset_index()

  index  country
0    KH       40
1    MY       34
2    US       30
3    CN       26
4    UA       26
5    IN       22
6    SA       14
7    BD       12
8    MD        2
9    VN        2

In [20]:
# df.addcolumns('cases')
df.head()

    country
KH       40
MY       34
US       30
CN       26
UA       26

In [22]:
df.shape

(10, 1)

In [23]:
df

    country
KH       40
MY       34
US       30
CN       26
UA       26
IN       22
SA       14
BD       12
MD        2
VN        2

In [26]:
country_count1 = traffick_data_df['country_of_exploitation'].nunique()

country_count1

10